{
  "metadata": {
    "title": "Lívia Devolder | Full Stack Developer",
    "description": "Lívia Devolder Profissional Portfolio"
  },
  "nav": {
    "title": "Lívia Devolder",
    "language": "Language"
  },
  "intro": {
    "title": "Full Stack Developer",
    "quote": "\"No one is so big that they can't learn, nor so small that they can't teach.\"",
    "author": "- Aesop"
  },
  "about": {
    "title": "About Me",
    "description": "I'm Lívia, a full stack developer with over 4 years of experience working with technologies like <strong>Node.js</strong>, <strong>TypeScript</strong>, <strong>React</strong>, and <strong>WordPress</strong>.<br></br><br></br>I value well-structured technical development with attention to user experience and clear communication. I believe great projects are born from listening, collaboration, and solutions designed with empathy.",
    "education": {
      "graduation": {
        "course": "Technology in Computer Systems",
        "university": "Fluminense Federal University",
        "duration": "2021 - 2023"
      },
      "mba": {
        "course": "MBA in Software Engineering with AI",
        "university": "Full Cycle",
        "duration": "Oct 2025 - Oct 2026"
      }
    },
    "languages": {
      "portuguese": {
        "title": "Portuguese",
        "level": "Native"
      },
      "english": {
        "title": "English",
        "level": "Advanced"
      },
      "spanish": {
        "title": "Spanish",
        "level": "Basic"
      }
    },
    "experience": {
      "brq": {
        "title": "BRQ Digital Solutions",
        "role": "Trainee - Junior Developer",
        "duration": "Jun 2021 - Aug 2023",
        "description": "Responsible for developing and maintaining web applications, specifically in Renault Group's e-commerce projects, as a full stack developer."
      },
      "clearsale": {
        "title": "ClearSale",
        "role": "Junior Developer",
        "duration": "Aug 2023 - Nov 2024",
        "description": "Responsible for developing and maintaining web applications and scrapping services for various platforms, working on the back-end."
      },
      "deal": {
        "title": "Deal Technologies",
        "role": "Mid-level Developer",
        "duration": "Nov 2024 - Jul 2025",
        "description": "Responsible for developing and maintaining web applications for various clients, including B3 and Porto Seguro."
      },
      "brq-2": {
        "title": "BRQ Digital Solutions",
        "role": "Mid-level Developer",
        "duration": "Jul 2025 - Currently",
        "description": "Responsible for developing and maintaining web applications, specifically in Renault Group's after-sales systems, as a full-stack developer."
      }
    }
  },
  "services": {
    "title": "Services",
    "web": {
      "title": "Web Development",
      "description": "Creation of scalable systems, REST APIs and robust solutions using Next.js, NestJS, MongoDB and AWS. Ideal for complex applications or cloud integrations."
    },
    "pwa": {
      "title": "Scalable PWAs",
      "description": "Progressive web and mobile applications using Firebase, Next.js and integrated authentication. Perfect for MVPs or lean products."
    },
    "company": {
      "title": "Corporate Websites",
      "description": "Beautiful, lightweight and objective websites for companies, professionals or local businesses, with good performance and basic SEO."
    },
    "hearing": {
      "title": "Human-Centered Approach",
      "description": "Empathetic communication, active listening, and a focus on turning ideas into personalized digital products. You speak, I translate into code."
    }
  },
  "projects": {
    "title": "Projects",
    "data": {
      "scraper": {
        "title": "Automations",
        "description": "I build bridges between the scattered information on the web and the strategic value for your business. With expertise in automation and web scraping, I develop custom bots that navigate, extract, and structure data with high precision and efficiency.<br></br><br></br>Whether it's a CAPTCHA-protected site, a single-page application with infinite scrolling, or the need to collect millions of data points daily, I have the experience and the right tools for the job."
      },
      "renault": {
        "title": "Renault Store",
        "description": "I actively participated in the development team for the \"Renault Store\", a large-scale e-commerce platform designed for selling new vehicles in several Latin American countries.<br></br><br></br>As part of the team, I collaborated on building a robust and scalable full-stack solution. My responsibilities included developing reusable front-end components with Next.js and Chakra UI, and implementing endpoints and business logic in the back-end API with Nest.js.<br></br><br></br>I worked directly with TypeScript across the entire stack to ensure code quality and maintainability, as well as assisting with the modeling and integration of the PostgreSQL database. The project required a special focus on internationalization (i18n) to adapt the shopping experience to each specific market."
      },
      "borala": {
        "title": "Bora Lá!",
        "description": "I worked on the development of the \"Bora Lá\" project, a complete solution that includes an administrative dashboard and two mobile apps (PWAs). I was responsible for creating a unified and efficient experience for different user profiles.<br></br><br></br>On the front-end, I used Next.js to build both the control panel and the PWAs, ensuring performance and the ability to be installed on mobile phones. The interface was developed with Chakra UI to maintain visual consistency. For the back-end and infrastructure, I implemented an API with Nest.js and used Firebase services (like Authentication and Firestore) and Google Cloud Platform (GCP) to ensure scalability and data security."
      }
    }
  },
  "footer": {
    "text": "© 2025 Lívia Devolder. All rights reserved.",
    "links": {
      "linkedin": "https://www.linkedin.com/in/livia-devolder-pinheiro/",
      "github": "https://github.com/LiviaDevolder",
      "email": "mailto:liviadevolder@gmail.com"
    }
  },
  "accessibility": {
    "colorModeToggle": "Toggle dark/light mode",
    "languageSelect": "Select website language",
    "linkedinProfile": "Lívia Devolder's LinkedIn profile",
    "sendEmail": "Send email to Lívia Devolder",
    "githubProfile": "Lívia Devolder's GitHub profile",
    "profileImage": "Lívia Devolder's profile picture"
  }
}
