{
  "metadata": {
    "title": "Lívia Devolder | Desenvolvedora Full Stack",
    "description": "Portfólio profissional de Lívia Devolder"
  },
  "nav": {
    "title": "Lívia Devolder",
    "language": "Idioma"
  },
  "intro": {
    "title": "Desenvolvedora FullStack",
    "quote": "\"Ninguém é tão grande que não possa aprender, nem tão pequeno que não possa ensinar\"",
    "author": "- Esopo"
  },
  "about": {
    "title": "Sobre Mim",
    "description": "Sou Lívia, desenvolvedora full stack com mais de 4 anos de experiência com tecnologias como <strong>Node.js</strong>, <strong>TypeScript</strong>, <strong>React</strong> e <strong>WordPress</strong>.<br></br><br></br>Valorizo um desenvolvimento técnico bem estruturado, com atenção à experiência do usuário e uma comunicação clara. Acredito que bons projetos nascem da escuta, da colaboração e de soluções pensadas com empatia.",
    "education": {
      "graduation": {
        "course": "Tecnologia em Sistemas da Computação",
        "university": "Universidade Federal Fluminense",
        "duration": "2021 - 2023"
      },
      "mba": {
        "course": "MBA em Engenharia de Software com IA",
        "university": "Full Cycle",
        "duration": "Out 2025 - Out 2026"
      }
    },
    "languages": {
      "portuguese": {
        "title": "Português",
        "level": "Nativo"
      },
      "english": {
        "title": "Inglês",
        "level": "Avançado"
      },
      "spanish": {
        "title": "Espanhol",
        "level": "Básico"
      }
    },
    "experience": {
      "brq": {
        "title": "BRQ Digital Solutions",
        "role": "Desenvolvedor Trainee - Junior",
        "duration": "Jun 2021 - Ago 2023",
        "description": "Responsável por desenvolver e manter aplicações web, especificamente nos e-commerces do Grupo Renault, como full-stack."
      },
      "clearsale": {
        "title": "ClearSale",
        "role": "Desenvolvedor Junior",
        "duration": "Ago 2023 - Nov 2024",
        "description": "Responsável por desenvolver e manter aplicações web e serviços de scrapping de plataformas como back-end."
      },
      "deal": {
        "title": "Deal Technologies",
        "role": "Desenvolvedor Pleno",
        "duration": "Nov 2024 - Jul 2025",
        "description": "Responsável por desenvolver e manter aplicações web de diferentes clientes, como B3 e Porto Seguro."
      },
      "brq-2": {
        "title": "BRQ Digital Solutions",
        "role": "Desenvolvedor Pleno",
        "duration": "Jul 2025 - Atualmente",
        "description": "Responsável por desenvolver e manter aplicações web, especificamente no pós venda do Grupo Renault, como full-stack."
      }
    }
  },
  "services": {
    "title": "Serviços",
    "web": {
      "title": "Desenvolvimento Web",
      "description": "Criação de sistemas escaláveis, APIs REST e soluções robustas com Next.js, NestJS, MongoDB e AWS. Ideal para aplicações complexas ou integrações com nuvem."
    },
    "pwa": {
      "title": "PWAs Escaláveis",
      "description": "Aplicações progressivas para web e mobile com Firebase, Next.js e autenticação integrada. Perfeito para MVPs ou produtos enxutos."
    },
    "company": {
      "title": "Sites Institucionais",
      "description": "Sites bonitos, leves e objetivos para empresas, profissionais ou negócios locais, com boa performance e SEO básico."
    },
    "hearing": {
      "title": "Atendimento Humanizado",
      "description": "Comunicação empática, escuta ativa e foco em transformar ideias em produtos digitais personalizados. Você fala, eu traduzo para o código."
    }
  },
  "projects": {
    "title": "Projetos",
    "data": {
      "scraper": {
        "title": "Automações",
        "description": "Eu construo pontes entre a informação dispersa na web e o valor estratégico para o seu negócio. Com expertise em automação e web scraping, desenvolvo robôs sob medida que navegam, extraem e estruturam dados com alta precisão e eficiência.<br></br><br></br>Seja um site protegido por CAPTCHAs, uma aplicação de página única com rolagem infinita ou a necessidade de coletar milhões de pontos de dados diariamente, eu tenho a experiência e as ferramentas certas para o trabalho."
      },
      "donna": {
        "title": "Donna Plus Size Atacado",
        "description": "Desenvolvi uma plataforma de e-commerce B2B de alta performance, com o objetivo de modernizar a experiência de compra atacadista e simplificar a gestão de produtos para o cliente.<br></br><br></br>Utilizando uma arquitetura headless, construí um front-end ágil e otimizado para SEO com Next.js e Chakra UI. O back-end aproveita a robustez do WordPress com WooCommerce, permitindo que a equipe gerencie o catálogo e os pedidos através de um painel familiar, enquanto os clientes desfrutam de um site ultrarrápido.<br></br><br></br>O projeto inclui integração completa com o Mercado Pago para pagamentos seguros e automação de e-mails transacionais (confirmação de pedido, envio, etc.) via Brevo."
      },
      "renault": {
        "title": "Loja Renault",
        "description": "Participei ativamente da equipe de desenvolvimento da \"Loja Renault\", uma plataforma de e-commerce de grande escala projetada para a venda de veículos novos em diversos países da América Latina.<br></br><br></br>Como parte do time, colaborei na construção de uma solução full-stack robusta e escalável. Minhas responsabilidades incluíram o desenvolvimento de componentes reutilizáveis no front-end com Next.js e Chakra UI, e a implementação de endpoints e lógicas de negócio na API back-end com Nest.js.<br></br><br></br>Trabalhei diretamente com TypeScript em toda a stack para garantir a qualidade e a manutenibilidade do código, além de auxiliar na modelagem e integração com o banco de dados PostgreSQL. O projeto exigiu foco especial na internacionalização (i18n) para adaptar a experiência de compra a cada mercado específico."
      },
      "borala": {
        "title": "Bora Lá!",
        "description": "Atuei no desenvolvimento do projeto \"Bora Lá\", uma solução completa que engloba um dashboard administrativo e dois aplicativos móveis (PWA). Fui responsável por criar uma experiência unificada e eficiente para diferentes perfis de usuários.<br></br><br></br>No front-end, utilizei Next.js para construir tanto o painel de controle quanto os PWAs, garantindo performance e a capacidade de instalação nos celulares. A interface foi desenvolvida com Chakra UI para manter a consistência visual. Para o back-end e a infraestrutura, implementei uma API com Nest.js e utilizei os serviços do Firebase (como Authentication e Firestore) e da Google Cloud Platform (GCP) para garantir escalabilidade e segurança de dados."
      }
    }
  },
  "footer": {
    "text": "© 2025 Lívia Devolder. Todos os direitos reservados.",
    "links": {
      "linkedin": "https://www.linkedin.com/in/livia-devolder-pinheiro/",
      "github": "https://github.com/LiviaDevolder",
      "email": "mailto:liviadevolder@gmail.com"
    }
  },
  "accessibility": {
    "colorModeToggle": "Alternar modo escuro/claro",
    "languageSelect": "Selecionar idioma do site",
    "linkedinProfile": "Perfil do LinkedIn de Lívia Devolder",
    "sendEmail": "Enviar email para Lívia Devolder",
    "githubProfile": "Perfil do GitHub de Lívia Devolder",
    "profileImage": "Foto de perfil de Lívia Devolder"
  }
}
